# VS Code extensions. To update this file after installing/removing extensions, run:
#   code --list-extensions > vscode-extensions.txt
#
anthropic.claude-code
catppuccin.catppuccin-vsc
davidanson.vscode-markdownlint
eamodio.gitlens
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
zhuangtongfa.material-theme
